{
  "_name_or_path": "bert-base-cased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PERSON",
    "2": "I-PERSON",
    "3": "B-NORP",
    "4": "I-NORP",
    "5": "B-FAC",
    "6": "I-FAC",
    "7": "B-ORG",
    "8": "I-ORG",
    "9": "B-GPE",
    "10": "I-GPE",
    "11": "B-LOC",
    "12": "I-LOC",
    "13": "B-PRODUCT",
    "14": "I-PRODUCT",
    "15": "B-DATE",
    "16": "I-DATE",
    "17": "B-TIME",
    "18": "I-TIME",
    "19": "B-PERCENT",
    "20": "I-PERCENT",
    "21": "B-MONEY",
    "22": "I-MONEY",
    "23": "B-QUANTITY",
    "24": "I-QUANTITY",
    "25": "B-ORDINAL",
    "26": "I-ORDINAL",
    "27": "B-CARDINAL",
    "28": "I-CARDINAL",
    "29": "B-EVENT",
    "30": "I-EVENT",
    "31": "B-WORK_OF_ART",
    "32": "I-WORK_OF_ART",
    "33": "B-LAW",
    "34": "I-LAW",
    "35": "B-LANGUAGE",
    "36": "I-LANGUAGE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CARDINAL": 27,
    "B-DATE": 15,
    "B-EVENT": 29,
    "B-FAC": 5,
    "B-GPE": 9,
    "B-LANGUAGE": 35,
    "B-LAW": 33,
    "B-LOC": 11,
    "B-MONEY": 21,
    "B-NORP": 3,
    "B-ORDINAL": 25,
    "B-ORG": 7,
    "B-PERCENT": 19,
    "B-PERSON": 1,
    "B-PRODUCT": 13,
    "B-QUANTITY": 23,
    "B-TIME": 17,
    "B-WORK_OF_ART": 31,
    "I-CARDINAL": 28,
    "I-DATE": 16,
    "I-EVENT": 30,
    "I-FAC": 6,
    "I-GPE": 10,
    "I-LANGUAGE": 36,
    "I-LAW": 34,
    "I-LOC": 12,
    "I-MONEY": 22,
    "I-NORP": 4,
    "I-ORDINAL": 26,
    "I-ORG": 8,
    "I-PERCENT": 20,
    "I-PERSON": 2,
    "I-PRODUCT": 14,
    "I-QUANTITY": 24,
    "I-TIME": 18,
    "I-WORK_OF_ART": 32,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
